STMicroelectronics/STM32CubeWBA/Projects/STM32WBA65I-DK1/Applications/BLE_Thread/BLE_Thread_SED_FreeRTOS_Generic/Core/Src/stm32wba65i_discovery.c
  /* Initialize JOY instance */
  hjoy_adc[JOY].Instance = JOY_ADC[JOY];

#if (USE_HAL_ADC_REGISTER_CALLBACKS == 0)
  ADC_MspInit(&hjoy_adc[JOY]);
#else /* (USE_HAL_ADC_REGISTER_CALLBACKS == 0) */
  if (IsJoyMspCbValid[JOY] == 0U)
  {
    /* Register the MSP callbacks */
    if (BSP_JOY_RegisterDefaultMspCallbacks(JOY) != BSP_ERROR_NONE)
    {
      status = BSP_ERROR_MSP_FAILURE;
    }
  }
#endif /* (USE_HAL_ADC_REGISTER_CALLBACKS == 0) */

  if (status == BSP_ERROR_NONE)
  {
    MX_ADC_Config_t mxAdcInit;
    mxAdcInit.ContinuousConvMode = (JoyMode == JOY_MODE_IT) ? ENABLE : DISABLE;
    if (MX_ADC4_Init(&hjoy_adc[JOY], &mxAdcInit) != HAL_OK)
    {
      status = BSP_ERROR_PERIPH_FAILURE;
    }
    else
    {
      /* Store current joystick pins */
      CurrentJoyPins[JOY] = JoyPins;

      if (JoyMode == JOY_MODE_IT)
      {
#if (USE_HAL_ADC_REGISTER_CALLBACKS == 1)
        /* Register ADC Analog watchdog callback */
        if (HAL_ADC_RegisterCallback(&hjoy_adc[JOY], HAL_ADC_LEVEL_OUT_OF_WINDOW_1_CB_ID,
                                     ADC_LevelOutOfWindowCallback) != HAL_OK)
        {
          status = BSP_ERROR_PERIPH_FAILURE;
        }
#endif /* (USE_HAL_ADC_REGISTER_CALLBACKS == 1) */
        if (HAL_ADC_Start(&hjoy_adc[JOY]) != HAL_OK)
        {
          status = BSP_ERROR_PERIPH_FAILURE;
        }
      }
    }
  }

  return status;
}

/**
  * @brief  De-initialize Joystick.
  * @param  JOY Joystick to be de-init.
  *   This parameter can be JOY1
  * @param  JoyPins Specifies joystick pin.
  *   This parameter can be one of following parameters:
  *     @arg JOY_SEL
  *     @arg JOY_DOWN
  *     @arg JOY_LEFT
  *     @arg JOY_RIGHT
  *     @arg JOY_UP
  *     @arg JOY_ALL: all pins
  * @retval BSP error code
  */
int32_t BSP_JOY_DeInit(JOY_TypeDef JOY, JOYPin_TypeDef JoyPins)
{
  int32_t status = BSP_ERROR_NONE;

  /* JOY de-init */
  hjoy_adc[JOY].Instance = JOY_ADC[JOY];
  if (HAL_ADC_DeInit(&hjoy_adc[JOY]) != HAL_OK)
  {
    status = BSP_ERROR_PERIPH_FAILURE;
  }
  else
  {
#if (USE_HAL_ADC_REGISTER_CALLBACKS == 0)
    ADC_MspDeInit(&hjoy_adc[JOY]);
#endif /* (USE_HAL_ADC_REGISTER_CALLBACKS == 0) */
    /* Update current joystick pins */
    CurrentJoyPins[JOY] = 0U;
  }

  return status;
}

/**
  * @brief  Get Joystick state.
  * @param  JOY Joystick.
  *   This parameter can be JOY1
  * @retval BSP error code if value negative or one of following value:
  *     @arg JOY_NONE
  *     @arg JOY_SEL
  *     @arg JOY_DOWN
  *     @arg JOY_LEFT
  *     @arg JOY_RIGHT
  *     @arg JOY_UP
  */
int32_t BSP_JOY_GetState(JOY_TypeDef JOY)
{
  int32_t   retval;
  int32_t   startadc;
  uint16_t  keyconvertedvalue;

  /* No ADC conversion */
  startadc = 0UL;

  /* Check if ADC conversion is ongoing */
  if(LL_ADC_REG_IsConversionOngoing(hjoy_adc[JOY].Instance) == 1UL)
  {
     /* ADC already started */
     startadc = 1UL;
  }
  else
  {
    /* Start the conversion process */
    if (HAL_ADC_Start(&hjoy_adc[JOY]) != HAL_OK)
    {
      retval = BSP_ERROR_PERIPH_FAILURE;
    }
    else
    {
      /* Wait for the end of conversion */
      if (HAL_ADC_PollForConversion(&hjoy_adc[JOY], JOY_ADC_POLL_TIMEOUT) != HAL_OK)
      {
        retval = BSP_ERROR_PERIPH_FAILURE;
      }
      else
      {
        /* ADC started */
        startadc = 1UL;
      }
    }
  }

  /* If ADC is well started */
  if( startadc == 1UL)
  {
    /* Get the converted value of regular channel */
    keyconvertedvalue = HAL_ADC_GetValue(&hjoy_adc[JOY]);

    /* The ADC value gives the pad pressed.
    JOY_NONE  -> around 3,3V  -> ADC value around 4095.
    JOY_RIGHT -> around 2.6V  -> ADC value around 3288.
    JOY_UP    -> around 2.0V  -> ADC value around 2494.
    JOY_DOWN  -> around 1.3V  -> ADC value around 1638.
    JOY_LEFT  -> around 0.6V  -> ADC value around 831.
    JOY_SEL   -> around 0V    -> ADC value around 0. */

    if ((keyconvertedvalue >= 2800U) && (keyconvertedvalue < 3600U))
    {
      retval = (CurrentJoyPins[JOY] & JOY_RIGHT) ? JOY_RIGHT : JOY_NONE;
    }
    else if ((keyconvertedvalue >= 2000U) && (keyconvertedvalue < 2800U))
    {
      retval = (CurrentJoyPins[JOY] & JOY_UP) ? JOY_UP : JOY_NONE;
    }
    else if ((keyconvertedvalue >= 1200U) && (keyconvertedvalue < 2000U))
    {
      retval = (CurrentJoyPins[JOY] & JOY_DOWN) ? JOY_DOWN : JOY_NONE;
    }
    else if ((keyconvertedvalue >= 400U) && (keyconvertedvalue < 1200U))
    {
      retval = (CurrentJoyPins[JOY] & JOY_LEFT) ? JOY_LEFT : JOY_NONE;
    }
    else if (keyconvertedvalue < 400U)
    {
      retval = (CurrentJoyPins[JOY] & JOY_SEL) ? JOY_SEL : JOY_NONE;
    }
    else
    {
      retval = JOY_NONE;
    }
    if(LL_ADC_REG_IsConversionOngoing(hjoy_adc[JOY].Instance) == 1UL)
    {
      /* Wait converted value return inside ADC Threshold to avoid new interrupt */
      do
      {
        keyconvertedvalue = HAL_ADC_GetValue(&hjoy_adc[JOY]);
      }
      while (keyconvertedvalue < 3600U);
    }
  }

  return retval;
}

/**
  * @brief  Initialize AD4.
  * @param  hadc ADC handle.
  * @param  MXInit ADC initialization structure.
  * @retval HAL status.
  */
__weak HAL_StatusTypeDef MX_ADC4_Init(ADC_HandleTypeDef* hadc, MX_ADC_Config_t *MXInit)
{
  HAL_StatusTypeDef status = HAL_ERROR;

  /* ADC Config */
  hadc->Init.ClockPrescaler        = ADC_CLOCK_ASYNC_DIV256;
  hadc->Init.Resolution            = ADC_RESOLUTION_12B;
  hadc->Init.DataAlign             = ADC_DATAALIGN_RIGHT;
  hadc->Init.ScanConvMode          = ADC_SCAN_DISABLE;
  hadc->Init.EOCSelection          = ADC_EOC_SINGLE_CONV;
  hadc->Init.LowPowerAutoWait      = DISABLE;
  hadc->Init.LowPowerAutoPowerOff  = DISABLE;
  hadc->Init.LowPowerAutonomousDPD = ADC_LP_AUTONOMOUS_DPD_DISABLE;
  hadc->Init.ContinuousConvMode    = MXInit->ContinuousConvMode;
  hadc->Init.NbrOfConversion       = 1;
  hadc->Init.DiscontinuousConvMode = DISABLE;
  hadc->Init.ExternalTrigConv      = ADC_SOFTWARE_START;
  hadc->Init.ExternalTrigConvEdge  = ADC_EXTERNALTRIGCONVEDGE_NONE;
  hadc->Init.DMAContinuousRequests = DISABLE;
  hadc->Init.Overrun               = ADC_OVR_DATA_OVERWRITTEN;
  hadc->Init.SamplingTimeCommon1   = ADC_SAMPLETIME_814CYCLES_5;
  hadc->Init.SamplingTimeCommon2   = ADC_SAMPLETIME_814CYCLES_5;
  hadc->Init.OversamplingMode      = DISABLE;
  hadc->Init.TriggerFrequencyMode  = ADC_TRIGGER_FREQ_LOW;

  /* Initialize ADC */
  if (HAL_ADC_Init(hadc) == HAL_OK)
  {
    if (HAL_ADCEx_Calibration_Start(hadc) == HAL_OK)
    {
      /* Select the ADC Channel to be converted */
      ADC_ChannelConfTypeDef sConfig;
      sConfig.Channel      = JOY1_ADC_CHANNEL;
      sConfig.Rank         = ADC_REGULAR_RANK_1;
      sConfig.SamplingTime = ADC_SAMPLINGTIME_COMMON_1;
      /* Return Joystick initialization status */
      status = HAL_ADC_ConfigChannel(hadc, &sConfig);

